//04--------------------------------------------------------------------------------------------------------------------
"use strict";

//let number = 5;
//const leftBorderWidth = 1;


//number = 10;
//console.log(number);


//const obj = {
    //a: 50
//};


//obj.a = 10


//console.log(obj);


//console.log(Name)
//var Name = 'Naumov'


//var kvadrat = 'red';
//kvadrat = 'green';
//console.log(kvadrat)


//{
    //let result = 50;
    //console.log(result);//
//}


//06--------------------------------------------------------------------------------------------------------------------
// number = 10.5; 20; // числа
// console.log(-4/0); // -Infinity (задача не выполнима)


// console.log('string' *10); // выводит Nan означает что это не число 


// const persone = "Artem"; // строки string, name  


// const bool = true; false; // выдает значение ложь или истина 

// //console.log(sokfksok); //такого кода не существует выводит ошибку

// let und; 
// console.log(und); // выодит undefined (нету свойсва к которому принадлежит имя)

// const obj = {      // 1(переменная) 2(имя переменной) 
//     Name: "Artem", // 1(ключ) 2(свойства)
//     age: 23,       // 1(ключ) 2(свойства)
//     isMarried: false // 1(ключ) 2(свойства)
// };
// //console.log(obj.Name)
// console.log(obj["Name"]) // 2ой способ присвоить свойства
             
//                 //0        //1       //2      //3    - ключи
// let arr = ['plum.png', 'orange.jpg', 6, 'apple.bmp']; //- свойтва
// console.log(arr[1]); //вывод в консоль (orange.jpg)


//07------------------------------------------------------------------------------------------------------------------

//alert('Hello'); // выводит на экран окно с текстом


// const result = confirm("Вы здесь?"); // выводит на экран окно с текстом и можно ответить ок или отмена (true, folse) 
// console.log(result); //вывести в консоль данные


// const answer = prompt ("Вам есть 18?", "18"); //пользователь может ответить на вопрос и выбрать выриант ответа true, folse)
// console.log(typeof (answer)); //вывести в консоль данные, если вписать свой текст выводит в терминал то значение (typeof -пишем чтобы убедится что это строка)


// const answers = []; //задем пустой массив после присваиваем ему значения 
// answers[0] = prompt('Как ваше имя,?', ''); // записываем вопросы позьзователю
// answers[1] = prompt('Как ваше фамилия,?', ''); // записываем вопросы позьзователю
// answers[2] = prompt('Сколько вам лет?,?', ''); // записываем вопросы позьзователю
// console.log(answers);
// if(NUmber(answers[2])<19){
//     window.close()
//     }

//08-------------------------------------------------------------------------------------------------------------------

// const category = 'toys';
// console.log(`https://someurl.com/${category}/5`); // для такого добавление используются косые ковычки(`) или просто обычные ковычки но со старым присваиванием +

// const user = "Artem";
// alert(`Привет, ${user}`); // динмамическая интрополяция 


//09-------------------------------------------------------------------------------------------------------------------

// console.log('arr' + ' - object' ); // соединяет два значения с помошью знака +
// console.log(4 + ' - object'); // соединяет два значения с помошью знака +


// let incr = 10, // инкремент 
//     decr = 10; // дискремент 
// ++incr; //префиксная форма
// decr--; //постфиксная форма
// console.log(incr);
// console.log(decr);

 
//console.log(5%2);


//console.log(2 + 2 * 2 === 8); // логическая цепочка 


// && - оператор И (если оба значение true то выодиться значение true при другом значение будет false)
// || - оператор ИЛИ (если хотябы одно значение true то выводиться в терминал true)
// ! - оператор отрицания (меняется значение на противополженое true - false или на оборот)
// const isChecked = true,
//       isClose = false;
// console.log(isChecked || isClose); 

